-- MySQL dump 10.18  Distrib 10.3.27-MariaDB, for Linux (x86_64)
--
-- Host: localhost    Database: IM
-- ------------------------------------------------------
-- Server version	10.3.27-MariaDB

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `Friend`
--

DROP TABLE IF EXISTS `Friend`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `Friend` (
  `Friend_id` int(11) NOT NULL AUTO_INCREMENT,
  `UserFirst_id` int(11) NOT NULL,
  `UserSecond_id` int(11) NOT NULL,
  PRIMARY KEY (`Friend_id`),
  UNIQUE KEY `UserFirst_id` (`UserFirst_id`,`UserSecond_id`)
) ENGINE=InnoDB AUTO_INCREMENT=30 DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Friend`
--

LOCK TABLES `Friend` WRITE;
/*!40000 ALTER TABLE `Friend` DISABLE KEYS */;
INSERT INTO `Friend` VALUES (21,1,1),(1,1,2),(2,1,3),(3,1,4),(4,1,5),(5,1,6),(9,1,7),(10,1,8),(11,1,9),(12,1,10),(13,1,11),(16,1,262143),(15,1,262144),(18,262143,3),(17,262143,4),(20,262143,6),(19,262143,262144),(22,262145,1),(26,262145,3),(25,262145,4),(23,262145,262143),(24,262145,262144),(27,262148,1),(29,262148,4),(28,262148,262143);
/*!40000 ALTER TABLE `Friend` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `User`
--

DROP TABLE IF EXISTS `User`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `User` (
  `User_id` int(11) NOT NULL AUTO_INCREMENT,
  `Account` varchar(255) NOT NULL,
  `Password` varchar(255) NOT NULL,
  PRIMARY KEY (`User_id`),
  UNIQUE KEY `Account` (`Account`)
) ENGINE=InnoDB AUTO_INCREMENT=262149 DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `User`
--

LOCK TABLES `User` WRITE;
/*!40000 ALTER TABLE `User` DISABLE KEYS */;
INSERT INTO `User` VALUES (1,'root','root'),(2,'anny','root'),(3,'boy','root'),(4,'cat','root'),(5,'dady','root'),(6,'edge','root'),(7,'faker','root'),(8,'gamer','root'),(9,'high','root'),(10,'Invoker','root'),(11,'Joker','root'),(262143,'test','test'),(262144,'hahh','hahh'),(262145,'success','root'),(262146,'',''),(262148,'kkk','root');
/*!40000 ALTER TABLE `User` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `chats`
--

DROP TABLE IF EXISTS `chats`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `chats` (
  `Chat_id` int(11) NOT NULL AUTO_INCREMENT,
  `Sender_id` int(11) NOT NULL,
  `Receiver_id` int(11) NOT NULL,
  `Send_time` timestamp NOT NULL DEFAULT current_timestamp(),
  `Msg` varchar(1024) DEFAULT NULL,
  PRIMARY KEY (`Chat_id`)
) ENGINE=InnoDB AUTO_INCREMENT=245 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `chats`
--

LOCK TABLES `chats` WRITE;
/*!40000 ALTER TABLE `chats` DISABLE KEYS */;
INSERT INTO `chats` VALUES (1,1,2,'2021-03-30 10:35:21','test'),(2,1,3,'2021-03-30 10:35:21','test1'),(3,1,4,'2021-03-30 10:35:21','test2'),(4,1,5,'2021-03-30 10:35:21','test3'),(5,2,1,'2021-03-30 10:42:26','test2'),(6,2,1,'2021-03-30 10:42:26','test5'),(7,2,1,'2021-03-30 10:42:26','test6'),(8,2,1,'2021-03-30 10:42:27','test5'),(9,2,1,'2021-03-30 10:42:27','test6'),(10,2,1,'2021-03-30 10:42:27','test5'),(11,2,1,'2021-03-30 10:42:27','test6'),(12,5,1,'2021-03-30 10:42:27','test5'),(13,6,1,'2021-03-30 10:42:27','test6'),(14,3,1,'2021-03-30 10:42:27','test3'),(15,4,1,'2021-03-30 10:42:27','test4'),(16,5,1,'2021-03-30 10:42:27','test5'),(17,6,1,'2021-03-30 10:42:27','test6'),(19,1,2,'2021-03-30 17:00:13','qwe'),(20,1,2,'2021-03-30 17:02:08','qwe'),(21,1,2,'2021-03-30 17:40:33','asd'),(22,1,2,'2021-03-30 17:41:09','qweqw'),(23,1,2,'2021-03-30 17:41:33','sdfasdfasdads'),(24,1,2,'2021-03-30 20:20:37','12321'),(25,1,2,'2021-03-30 20:20:52','qwewqewqeq'),(26,1,2,'2021-03-30 20:20:55','qwewq'),(27,1,2,'2021-03-31 06:54:42','hahahah'),(28,1,2,'2021-03-31 06:54:44','hahahah'),(29,1,2,'2021-03-31 06:54:45','hahahah'),(30,1,2,'2021-03-31 06:54:46','hahahah'),(31,1,2,'2021-03-31 06:54:47','hahahah'),(32,1,2,'2021-03-31 06:54:49','hahahah'),(33,1,2,'2021-03-31 06:54:50','hahahah'),(34,1,2,'2021-03-31 06:54:51','hahahah'),(35,2,1,'2021-03-31 07:08:38','eee'),(36,2,1,'2021-03-31 07:09:11','dg'),(37,2,1,'2021-03-31 07:10:27','ttt'),(38,1,2,'2021-03-31 07:10:43','ert'),(39,2,1,'2021-03-31 07:11:09','rty'),(40,2,1,'2021-03-31 07:12:35','c'),(41,2,1,'2021-03-31 07:21:25','test'),(42,2,1,'2021-03-31 07:21:43','qwe'),(43,2,1,'2021-03-31 07:24:56','qwe'),(44,2,1,'2021-03-31 09:04:02','hehe'),(45,1,2,'2021-03-31 13:38:14','frffrfrfr'),(46,1,2,'2021-03-31 13:38:23','wrewrwerwe'),(47,1,2,'2021-03-31 13:41:14','dasdasdasdasda'),(48,1,11,'2021-03-31 13:41:51','asdasda'),(49,1,10,'2021-03-31 13:41:56','qweqweqweqweqwe'),(50,1,9,'2021-03-31 13:42:08','qweqweqweeeeeeeeeeeeeeeeeeeeeeeeeeeeeee'),(51,1,7,'2021-03-31 13:42:13','waaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa'),(52,1,6,'2021-03-31 13:42:21','qwewwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww'),(53,1,5,'2021-03-31 13:42:30','fsdfasdfasdfasdfas'),(54,1,5,'2021-03-31 13:42:32','wqerqwerqwerqwe'),(55,1,4,'2021-03-31 13:42:34','werqwerqwer'),(56,1,3,'2021-03-31 13:42:37','weqrwqerqwerqwer'),(57,1,2,'2021-03-31 13:42:40','sgfasdgsdrgwergerwge'),(58,1,2,'2021-03-31 13:42:43','rwetergsdfgesrtghwrth'),(59,1,2,'2021-03-31 13:42:46','drgsdrgdfgserdtgerhtrhrtey'),(60,1,2,'2021-03-31 13:42:54','gsdfgsdgherthrthdfghrythjrytjhrtyhjtyjnhtygrjnhtenjtyjnetyjyrthtyrhrt'),(61,1,2,'2021-03-31 13:43:07','sdfgsdfgsdfgherthrtyehjtyejntyujrthrtherthrtyhtyrhtyejh'),(62,1,2,'2021-03-31 13:43:16','dsfgdfsgdfsgdfghrthertyhjntyehnfgdbdfghrtyhrtyehfghgsdfgsdfghsthryhthrtertertretdsf'),(63,1,2,'2021-03-31 13:43:27','sgdfgsdfgesryhrthrthdfgetrthrthewgwrehtrejuiopokghjk,uio,mlioghjmghfjfghjfghjftyjdyhjdfghjfghjrtyuwqwyrthrftghdfghfgdjtyjrsthsrtysrtys'),(64,1,2,'2021-03-31 13:43:34','gfjfghjfghjrtyujrtyujyu'),(65,1,2,'2021-03-31 13:43:43','rawerzsdgdfgxdfhfgjdfhjghdfjtyjtyjfghj'),(66,1,7,'2021-03-31 13:43:47','hdfghdfghdfg'),(67,1,6,'2021-03-31 13:43:50','yrtyrtyert'),(68,1,3,'2021-03-31 13:43:54','ytryrteyertye'),(69,1,8,'2021-03-31 13:59:19','??'),(70,1,8,'2021-03-31 13:59:25','???????????????????'),(71,1,2,'2021-03-31 13:59:35','??????????'),(72,2,1,'2021-03-31 14:00:19','???'),(73,1,2,'2021-03-31 18:00:18','qwe'),(74,2,1,'2021-03-31 18:01:34','error'),(75,1,2,'2021-03-31 19:07:52','qwe'),(76,1,2,'2021-03-31 19:07:58','asdzxc'),(77,1,2,'2021-03-31 19:08:03','asdzxcv'),(78,1,2,'2021-03-31 19:08:11','qwe'),(79,1,2,'2021-03-31 20:24:43','qqq'),(80,2,1,'2021-03-31 20:25:54','qweqw'),(81,2,1,'2021-03-31 20:27:07','qweqwewq'),(82,2,1,'2021-03-31 20:34:55','test'),(83,2,1,'2021-03-31 20:52:22','123'),(84,1,2,'2021-03-31 21:09:56','qwe'),(85,2,1,'2021-03-31 21:10:04','qweasd'),(86,2,1,'2021-03-31 21:10:40','asdv'),(87,1,2,'2021-03-31 21:11:01','eter'),(88,2,1,'2021-03-31 21:11:08','56'),(89,2,1,'2021-03-31 21:11:24','ytr'),(90,2,1,'2021-03-31 21:12:34','asd'),(91,2,1,'2021-03-31 21:12:47','qwe'),(92,1,2,'2021-03-31 21:12:50','asdas '),(93,1,2,'2021-03-31 21:12:53','fsdgfdsgfdsgsd'),(94,1,2,'2021-03-31 21:13:56','hhahahsdahhf\n'),(95,2,1,'2021-03-31 21:14:05','nihaoa\n'),(96,1,2,'2021-03-31 21:14:13','asdasdasd'),(97,4,1,'2021-03-31 21:15:04','asdsadasdwasd'),(98,1,4,'2021-03-31 21:15:26','rwerwerwer'),(99,1,4,'2021-03-31 21:18:59','jojo'),(100,1,2,'2021-03-31 21:19:17','oa'),(101,2,1,'2021-03-31 21:19:34','niha\nkkk'),(102,2,1,'2021-03-31 21:31:02','123'),(103,4,1,'2021-03-31 21:31:11','456'),(104,2,1,'2021-03-31 21:33:35','hhahah'),(105,4,1,'2021-03-31 21:33:50','xcvbnm'),(106,1,2,'2021-03-31 21:34:03','wrsetrcytvbh'),(107,1,4,'2021-03-31 21:34:10','1234567890'),(108,1,2,'2021-04-01 07:01:17','????\n'),(109,3,1,'2021-04-01 07:01:55','qweqweqw'),(110,1,3,'2021-04-01 07:01:59','asdasdsa'),(111,3,1,'2021-04-01 07:02:02','dfgsdgdfgdfgdfs'),(112,1,3,'2021-04-01 07:02:06','dfgsdfhdfgshdfh'),(113,3,1,'2021-04-01 07:02:09','ergergerdfsgsdfh'),(114,1,3,'2021-04-01 07:02:14','cvbcvbdsdfhfgsdhdfghfg'),(115,3,1,'2021-04-01 07:02:17','sdfgdfsgsdfg'),(116,3,1,'2021-04-01 07:02:19','bdfhfghfg'),(117,3,1,'2021-04-01 07:02:20','dfgsdfgsdfg'),(118,3,1,'2021-04-01 07:02:22','dfsgsdfhfdshsdf'),(119,3,1,'2021-04-01 07:02:26','dsfgfdsgxcvberhrthrthrgdfgdfg'),(120,3,1,'2021-04-01 07:02:29','gsdfgergdfgsdfh'),(121,3,1,'2021-04-01 07:02:31','dfsgsdfhsdfthrt'),(122,3,1,'2021-04-01 07:02:41','qresertasgsdfgdsfg'),(123,3,1,'2021-04-01 07:02:44','sdfgdfgsdfgergrtbfgb'),(124,3,1,'2021-04-01 07:02:46','sdfgdsfgs'),(125,1,3,'2021-04-01 07:02:51','123'),(126,1,3,'2021-04-01 07:02:53','234'),(127,1,3,'2021-04-01 07:02:55','345'),(128,1,2,'2021-04-01 17:52:01','qweasd'),(129,1,2,'2021-04-01 17:52:07','jhfgdhj'),(130,1,6,'2021-04-01 17:54:29','890\n\n'),(131,1,10,'2021-04-02 09:10:21','???????'),(132,1,9,'2021-04-02 09:10:23','?i?i??'),(133,1,8,'2021-04-02 09:10:26','????'),(134,1,7,'2021-04-02 09:10:29','????????'),(135,1,6,'2021-04-02 09:10:32','????????'),(136,1,5,'2021-04-02 09:10:35','???????'),(137,1,4,'2021-04-02 09:10:39','??????'),(138,1,3,'2021-04-02 09:10:43','???????'),(139,1,2,'2021-04-02 09:10:46','??????'),(140,1,2,'2021-04-02 09:20:30','?????'),(141,4,1,'2021-04-02 09:21:29','asdas'),(142,4,1,'2021-04-02 09:21:32','????'),(143,4,1,'2021-04-02 09:22:20','?????'),(144,4,1,'2021-04-02 09:22:26','hello'),(145,4,1,'2021-04-02 09:22:31','nihao '),(146,4,1,'2021-04-02 09:22:37','ok'),(147,1,4,'2021-04-02 09:22:40','asdasd'),(148,1,4,'2021-04-02 09:22:43','sdgsdfgsdfhgsrthrhbdrfg'),(149,1,4,'2021-04-02 09:22:45','asdfgasdgrfdagdsfg'),(150,1,4,'2021-04-02 09:29:30','qwewqe'),(151,1,2,'2021-04-02 09:54:44','asd'),(152,4,1,'2021-04-02 10:03:13','zxcc'),(153,4,1,'2021-04-02 10:29:35','dasd'),(154,1,4,'2021-04-02 10:33:23','asd'),(155,1,4,'2021-04-02 11:09:34','°¢Èø´ó'),(156,4,1,'2021-04-02 11:20:41','¹þ¹þ'),(157,4,1,'2021-04-02 11:22:44','hhe'),(158,4,1,'2021-04-02 11:22:59','hheasd'),(159,4,1,'2021-04-02 11:23:04','¹þ¹þ¹þ¹þ¹þ¹þ¹þ¹þ¹þ¹þ¹þ'),(160,4,1,'2021-04-02 11:23:13','¹þ¹þ'),(161,1,4,'2021-04-02 11:23:26','Óëi'),(162,6,1,'2021-04-02 11:25:01','¹þ¹þ¹þ'),(163,1,6,'2021-04-02 11:25:07','ºÇºÇºÇºÇºÇºÇºÇºÇ'),(164,1,6,'2021-04-02 11:25:47','ÄãºÃ£¬ÊÀ½ç'),(165,6,1,'2021-04-02 11:26:21','À²À²À²'),(166,1,6,'2021-04-02 11:26:25','À²À²À²'),(167,1,6,'2021-04-02 11:26:31','ÄãºÃ£¬Ì«ºÃÁË'),(168,1,2,'2021-04-02 11:33:33','²âÊÔ'),(169,1,3,'2021-04-02 11:33:37','²âÊÔ'),(170,1,4,'2021-04-02 11:33:41','²âÊÔ'),(171,1,5,'2021-04-02 11:33:43','²âÊÔ'),(172,1,7,'2021-04-02 11:33:48','²âÊÔ'),(173,1,8,'2021-04-02 11:33:51','²âÊÔ'),(174,1,9,'2021-04-02 11:33:53','²âÊÔ'),(175,1,10,'2021-04-02 11:33:56','²âÊÔ'),(176,1,11,'2021-04-02 11:33:59','²âÊÔ'),(177,6,1,'2021-04-02 11:56:32','´ÓµÚÈý·½Ê¿´ó·ò¸ÂË¹¶¼»á·¢¹âµÄº«¹úi»¹ÊÇÊÇ¶¹¸¯¸É¶¹¸¯¸ÉÊ¿´ó·ò¸ÒËÀ¶Ó·ç¸ñÊ¿´ó·ò'),(178,6,1,'2021-04-02 11:57:09','°¢Ë¹¶Ù·¢Éäµã'),(179,6,1,'2021-04-02 11:57:30','°¸·¢Ê±'),(180,6,1,'2021-04-02 11:57:57','·¨ËþºÕ'),(181,6,1,'2021-04-02 11:58:05','Ê¿´ó·ò¸ÒËÀ¶Ó·ç¸ñ '),(182,6,1,'2021-04-02 16:43:35','dfgs '),(183,1,262143,'2021-04-02 19:40:17','hahahha'),(184,1,5,'2021-04-02 19:43:04','gererger'),(185,262143,4,'2021-04-02 20:09:27','dasfsdf \n'),(186,262143,6,'2021-04-02 20:09:31','dsadsa'),(187,262143,1,'2021-04-02 20:18:36','¹þ¹þ¹þ¹þ¹þ¹þ¹þ'),(188,262143,3,'2021-04-02 20:19:36','Î¬¶û·ÃÎÊ·¢¸ÄÎ¯ÈÈÈÈ'),(189,262143,4,'2021-04-02 20:19:43','ÎÒÈ¥¶öÎÒÈ¥¶ñÈ¤Î¶'),(190,262143,262144,'2021-04-02 20:19:55','°¡ÊÖ¶¯·§ÊÖ¶¯·§ÊÖ¶¯·§'),(191,262143,6,'2021-04-02 20:19:58','´Óv²»Ì«ºÃ²»È»Ì¸ºÍ°üÈÝ¶Ô·½¹µÍ¨'),(192,262143,4,'2021-04-02 20:20:02','¶ûÌØÈË·ç¸ñv°¢¶ûÌ©'),(193,262143,3,'2021-04-02 20:20:07','É±ÉËµÐÈË·Ö¸øÉ«ÈçÍ¨¹ýÈâÌåÉÏÌåÓý½ÌÓýiÅ¶'),(194,262143,262144,'2021-04-02 20:20:21','µÄÊÇ·¨¹úÊ¿´ó·ò¹íµØ·½'),(195,262143,1,'2021-04-02 20:20:36','»Ø¸´¸üºÃµÄ·ç¸ñºÍµÄ·ç¸ñ'),(196,1,2,'2021-04-02 20:26:20','ÇëÎÊÇëÎÊ'),(197,1,3,'2021-04-02 20:26:24','°¢Ë¹¶ÙÈöµ©'),(198,1,4,'2021-04-02 20:26:27','°¢Ë¹¶ÙÈöµ©Èöµ©'),(199,1,5,'2021-04-02 20:26:31','²â³öÎ¬³ÖvÎ¢Èí'),(200,1,6,'2021-04-02 20:26:35','·¢Ê¿´ó·òÊ¿´ó·ò'),(201,1,7,'2021-04-02 20:26:38','·¢Ê¿´ó·ò´óÊ¦¸µµ«ÊÇ'),(202,1,8,'2021-04-02 20:26:41','·¢Éú´ó·¨Ê¦´ó·¨Ê¦·¢ÉúµÄ'),(203,1,262144,'2021-04-02 20:26:44','Èöµ©·¢Éäµã·¢Éäµã·¢Éäµã'),(204,1,9,'2021-04-02 20:26:48','Èöµ©·¢Éäµã·¢Éäµã·¢Éú´ó'),(205,1,10,'2021-04-02 20:26:51','Èöµ©·¢Éäµã·¢Éäµã·¢Éú´ó'),(206,1,11,'2021-04-02 20:26:55','·¢´óË®·¢Éäµã·¢Éäµã·¢Éäµã¸ø±»º¦ÈË·¢¸øËû'),(207,1,11,'2021-04-02 20:26:55',''),(208,1,11,'2021-04-02 20:26:57',''),(209,1,11,'2021-04-02 20:26:58',''),(210,1,11,'2021-04-02 20:26:58',''),(211,1,11,'2021-04-02 20:26:59',''),(212,1,262143,'2021-04-02 20:27:02','·¨Èöµ©·¢Éäµã·´¶Ô'),(213,1,262143,'2021-04-02 20:27:05','°¢Ë¹¶Ù·¢Éäµã'),(214,1,4,'2021-04-02 20:27:13','Èöµ©·¢Éäµã·¢Éäµã'),(215,1,4,'2021-04-02 20:27:17','Èöµ©·¢Éäµã·¢´óË®·¢Éäµã·¢Éäµã·¢¸ÁÉ½¶¹¸ù'),(216,1,4,'2021-04-02 20:27:32','¶¹¸¯¸ÉµØ·½ÊÇ¹Ì¶¨·½Ê½¸øÊ¿´ó·ò¹íµØ·½Èý¸ö¹íµØ·½¹íµØ·½ÊÇ¸ö´óË§¸çÉ½¶¹¸ù¶¹¸¯¸ÉµØ·½¸Ðµ½·­¸ú¶··ç¸ñ¸»ÉÌ´ó¼Ö»¹ÊÇ¶ÔºóÊÀµÄ·¨¹ú¸üºÃµÄ·ç¸ñºÍÊÇµÄ·ç¸ñºÍ´ó·çÊÖ¸ÐºÜÊæ·þµÄ¸ø´ó¼ÒÊÇ·ñ¸Ã¿¼ÂÇÊÇµÄ·µ»Ø½á¹û¿ÛË°µÄ·¢»ÓµÝ¹éº¯Êý´ð¸´¿Í»§¹«Ë¾µÄ¸¶¿îÁË¼Û¸ñ»¹ÊÇ¶Ì·¢ËÄ´ó»á¼Æ·¨¹æºÍÊ¿´ó·ò¼è¿à¸Ãº¯ÊýµÄ·´À¡¸ø'),(217,1,4,'2021-04-02 20:27:37','¹«¿ª±í´ï·½Ê½¸Ï¿ì°ÑÄãËµµÄ·¢¸ø¿Í»§½ÓÊÜ¶È'),(218,1,1,'2021-04-02 20:29:54','¶¹¸¯¸ÉµØ·½ÊÇ¸æËß¶Ô·½'),(219,1,1,'2021-04-02 20:29:56',''),(220,1,1,'2021-04-02 20:29:59','´óÈö´óÈö'),(221,1,1,'2021-04-02 20:30:02','ÇáÎ¢µÄÇáÎ¢µÄ'),(222,1,1,'2021-04-02 20:30:16','ËûµÄÈÕºó¼°Å¶ºöºö¾Í»á'),(223,1,1,'2021-04-02 20:30:23','É«ÈÃ¶Ô·½ÆÀÂÛ'),(224,262145,1,'2021-04-02 21:18:17','lalalla'),(225,262145,262143,'2021-04-02 21:18:19','qwe'),(226,262145,262143,'2021-04-02 21:18:23','¶îºÇºÇ'),(227,262145,262144,'2021-04-02 21:18:31','ÄãºÃ£¬ÊÀ½ç'),(228,262145,4,'2021-04-02 21:18:36','À²À²À²'),(229,262145,3,'2021-04-02 21:18:41','Ð»Ð»'),(230,1,262145,'2021-04-03 07:09:05','hahahh\n'),(231,1,4,'2021-04-03 08:01:36','hhaha'),(232,1,262148,'2021-04-03 08:01:49','À²À²À²À²'),(233,4,1,'2021-04-03 08:03:15','ÍÈ'),(234,262143,4,'2021-04-03 08:03:52','ÇëÎÊ'),(235,262143,4,'2021-04-03 08:03:59','·¨¹úº£¾ü'),(236,4,262143,'2021-04-03 08:04:01','¸ü¼Ó¹æ·¶»¯'),(237,4,262143,'2021-04-03 08:04:03','Î§ÈÆÌ«ÑôÈÃËû'),(238,1,4,'2021-04-03 08:04:22','È¨ÍþµÄ'),(239,1,262143,'2021-04-03 08:04:38','ÒâÍ¼½ÌÓý'),(240,1,262148,'2021-04-03 08:06:08','¹«¿ªi'),(241,1,262148,'2021-04-03 08:06:12','Ò²»á'),(242,262148,1,'2021-04-03 08:06:16','·è¿ñ·ÀÓù'),(243,262143,1,'2021-04-03 08:06:23','¹é»¹½è¿î¸ø'),(244,4,1,'2021-04-03 08:06:35','f·É»ú¿ª·¢');
/*!40000 ALTER TABLE `chats` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-04-03 18:28:50
